ConnectTest/src/Catalogs/accounts/accounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
	<name>accounts</name>
	<attributes>
		<name>birthday</name>
		<type>
			<types>Date</types>
			<dateQualifiers>
				<dateFractions>Date</dateFractions>
			</dateQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>canUpdatePersonalData</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>email</name>
		<type>
			<types>String</types>
			<stringQualifiers>
				<length>100</length>
			</stringQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>firstName</name>
		<type>
			<types>String</types>
			<stringQualifiers>
				<length>50</length>
			</stringQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>lastName</name>
		<type>
			<types>String</types>
			<stringQualifiers>
				<length>50</length>
			</stringQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>registrationDate</name>
		<type>
			<types>Date</types>
		</type>
	</attributes>
	<attributes>
		<name>secondName</name>
		<type>
			<types>String</types>
			<stringQualifiers>
				<length>50</length>
			</stringQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>gender</name>
		<type>
			<types>String</types>
			<stringQualifiers>
				<length>6</length>
			</stringQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>status</name>
		<type>
			<types>EnumRef.accountStatuses</types>
		</type>
	</attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/accounts/ManagerModule.bsl
Function attributesStructure() Export	
	
	attributesTable = DataLoad.getValueTable();
	attributesTableForNewItem = DataLoad.getValueTable();
	
	DataLoad.addRowInAttributesTable(attributesTable, "code", "phoneNumber", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "firstName", "firstName", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "secondName", "secondName", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "lastName", "lastName", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "birthday", "birthdayDate", "date");
	DataLoad.addRowInAttributesTable(attributesTable, "gender", "gender", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "email", "email", "string");
	DataLoad.addRowInAttributesTable(attributesTable, "canUpdatePersonalData", "canUpdatePersonalData", "boolean");
	
	Return New Structure("fillHolding, mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", False, "accounts", "catalog", "write", attributesTable, attributesTableForNewItem, New Structure());
		
EndFunction

Procedure PresentationFieldsGetProcessing(fields, standardProcessing)
	standardProcessing = False;	
	array = New Array();	
	array.Add("lastName");
	array.Add("firstName");	
	array.Add("code");	
	fields = array;	
EndProcedure

Procedure PresentationGetProcessing(data, presentation, standardProcessing)
	standardProcessing = False;
	presentation	= "" + data.lastName + " " + data.firstName + " (" + data.code + ")";		
EndProcedure
